### Содержание
  1. [Введение](#1)
  2. [Объект тестирования](#2)
  3. [Риски](#3)
  4. [Аспекты тестирования](#4)
  5. [Подходы к тестированию](#5)
  6. [Представление результатов](#6)
  7. [Выводы](#7)

<a name="1"></a>
### 1. Введение
  Данный файл содержит тест-план игры **Defender**. Основной целью тестирования является
  проверка приложения на соответствие требованиям.

<a name="2"></a>
### 2. Объект тестирования
Объект тестирования -  приложение **Defender**.  
   
   1. Функциональность:
+ функциональная полнота: приложение обязано выполнять все заявленные функции в соответствии с SRS;
+ функциональная корректность: приложение должно выполнять все заявленные функции;
+ функциональная целесообразность: отсутствуют незаявленные функции, которые бы мешали приложению выполнять первоначально поставленные задачи.

2. Удобство использования:   
+ Сбалансированный ИИ противников игры;
+ Подсвечивание предметов с которыми можно взаимодействовать;

<a name="3"></a>
### 3. Риски
К рискам можно отнести следующие пункты:
* Возможная рассинхронизация действий противников при увеличении частоты.
* Возможные провисания при первом заходе в игру из-за подгрузки доп. файлов.
<a name="4"></a>
### 4. Аспекты тестирования
К аспектам тестирования относится реализация основных функций приложения:
* Загрузка уровня
* Загрузочный экран между уровнями
* Корректное изменение громкости музыки
* Подсвечивание объектов для взаимодействия, если игрок находится в радиусе взаимодействия.
* Корректное взаимодействие с объектами (рычаг, дверь, сундук)

#### Функциональные требования:

##### Загрузка уровня
Этот вариант использования небходимо протестировать на:
1. Загрузку уровня и правильное расположение объектов на нем.
2. Корректность взаимодействия игрока и противников с окружением.

##### Загрузочный экран между уровнями
Этот вариант использования небходимо протестировать на:
1. Отображение возможной рекламы.
2. Отображение прогресса загрузки путем заполнения соответствующего поля.

##### Корректное изменение громкости музыки
Этот вариант использования небходимо протестировать на:
1. Кликабельность кнопок  в меню настроек.
2. Корректное изменение громкости.

##### Подсвечивание объектов для взаимодействия, если игрок находится в радиусе взаимодействия.
Этот вариант использования небходимо протестировать на:
1. Адекватный радиус взаимодействия.
2. Корректное испоьзование шейдера для подсветки объекта.

#### Нефункциональные требования:
1. Интуитивно понятное управление персонажем.
2. Сбалансированное количество противников и укрытий.

<a name="5"></a>
### 5. Подходы к тестированию
Каждый аспект тестирования был произведен с помощью системного тестирования.
Системное тестирование - это тестирование программы в целом.
Каждый тест производится вручную.
Такой метод подходит для небольших проектов.

<a name="6"></a>
### 6. Представление результатов
Результаты тестирования представлены в [таблице](results.md).

<a name="7"></a>
### 7. Выводы
Данный тестовый план позволяет протестировать основной функционал приложения.
Успешное прохождение всех тестов может свидетельствовать тому, что приложение
соответствует всем заявленным требованиям и стабильно работает.
